module.exports = [
  {
    id: '1',
    title: 'kieda-tamashi',
    tags: ['美团', '携程', '字节', '硕士', '后端'],
    description: '无ACM经验，今年2月底开始刷Leetcode准备面试。',
    avatar:
      'https://tva1.sinaimg.cn/large/008i3skNly1gq8r3su6wqj30og0o879n.jpg',
    body: `
- 时间：2021-05-05
- 被采访人：kieda-tamashi

# 无ACM经验，今年2月底开始刷Leetcode准备面试。


<img src="https://tva1.sinaimg.cn/large/008i3skNly1gq8q986d1pj30u0140773.jpg" width="400">

Q: 你是什么时候开始接触数据结构与算法（以下简称算法）的？
  
A:现在水硕应届。课程的话，大二学数据结构，大三学算法。无ACM经验，今年2月底开始刷Leetcode准备面试。

Q: 你是什么时候接触 91 天学算法（以下简称 91 天）的？从什么途径得知的？

A:今年2月底，好像是搜索啥搜到的，看了讲义感觉不错。

Q: 91 天有给你带来了什么样的变化么？

A:至少看到题有感觉了，虽然找工作很晚没进AT，但至少没失业

Q: 学习算法过程中有“顿悟”的时刻么？

A: 二分，边界弄得很清楚了。

Q: 你比较擅长的算法是什么？可以给大家简单分享一下么？

A:没什么擅长的，但比较喜欢做没有递归、stack相关的题目，往往不那么抽象，可以画图。

Q: 有没有什么想和刚入坑算法的同学分享的？

A: 早点开始，坚持每日一题，就算是抄的。

Q: 相对而言，你觉得 91 天哪里做的还不够好？应该如何改进？

A: 我觉得Github打卡有点太不好使了，也不怎么push和有可视激励，leetcode打卡还有积分显示，成长感明显，这边啥都没。

Q: 愿意把 91 天分享给你的朋友么？

A: 已经分享。 



他的 B 站账号是： https://space.bilibili.com/1836395 ，感兴趣的小伙伴可以关注一波啦~
      `
  }
]
