module.exports = [
  {
    id: '1',
    title: 'kieda-tamashi',
    tags: ['美团', '携程', '字节', '硕士', '后端'],
    description: '无ACM经验，今年2月底开始刷Leetcode准备面试。',
    avatar:
      'https://tva1.sinaimg.cn/large/008i3skNly1gq8r3su6wqj30og0o879n.jpg',
    body: `
- 时间：2021-05-05
- 被采访人：kieda-tamashi

# 无ACM经验，今年2月底开始刷Leetcode准备面试。


<img src="https://tva1.sinaimg.cn/large/008i3skNly1gq8q986d1pj30u0140773.jpg" width="400">

Q: 你是什么时候开始接触数据结构与算法（以下简称算法）的？
  
A:现在水硕应届。课程的话，大二学数据结构，大三学算法。无ACM经验，今年2月底开始刷Leetcode准备面试。

Q: 你是什么时候接触 91 天学算法（以下简称 91 天）的？从什么途径得知的？

A:今年2月底，好像是搜索啥搜到的，看了讲义感觉不错。

Q: 91 天有给你带来了什么样的变化么？

A:至少看到题有感觉了，虽然找工作很晚没进AT，但至少没失业

Q: 学习算法过程中有“顿悟”的时刻么？

A: 二分，边界弄得很清楚了。

Q: 你比较擅长的算法是什么？可以给大家简单分享一下么？

A:没什么擅长的，但比较喜欢做没有递归、stack相关的题目，往往不那么抽象，可以画图。

Q: 有没有什么想和刚入坑算法的同学分享的？

A: 早点开始，坚持每日一题，就算是抄的。

Q: 相对而言，你觉得 91 天哪里做的还不够好？应该如何改进？

A: 我觉得Github打卡有点太不好使了，也不怎么push和有可视激励，leetcode打卡还有积分显示，成长感明显，这边啥都没。

Q: 愿意把 91 天分享给你的朋友么？

A: 已经分享。 



他的 B 站账号是： https://space.bilibili.com/1836395 ，感兴趣的小伙伴可以关注一波啦~
      `
  },
  {
    id: '2',
    description: '一个很可爱，元气满满的转码少女~',
    tags: ['上岸中', '转码'],
    title: '易潇',
    avatar:
      'https://tva1.sinaimg.cn/large/008i3skNly1gq9qpzrs99j30u00u4q4o.jpg',
    body: `
- 时间：2021-05-07
- 被采访人：易潇
    
# 努力上岸的元气少女


<img src="https://tva1.sinaimg.cn/large/008i3skNly1gq9qojha3ij30u00u077t.jpg" width="400">

Q: 你是什么时候开始接触数据结构与算法（以下简称算法）的？

A:从很久之前就听说过数据结果与算法，但正式接触是打算转码的时候开始的

Q: 你是什么时候接触 91 天学算法（以下简称 91 天）的？从什么途径得知的？

A:我是从第二期就开始接触91的，大概是关注公众号的时候关注到的

Q: 91 天有给你带来了什么样的变化么？

A:91让我从觉得用哈希表O(N)写 two sum很惊奇到了现在可以迷迷糊糊的状态下手写完堆（狗头
最近因为刷了91，在做几个公司笔试初试(online coding challenge)的时候感觉很简单，也对自己的即将到来的面试更加有自信了~

Q: 学习算法过程中有“顿悟”的时刻么？

A:经常顿悟 -- 顿悟源自于重复和每次重复带来的更深层次的理解。

Q: 你比较擅长的算法是什么？可以给大家简单分享一下么？

A: 比较擅长的算法是看小漾怎么写的，然后默默的取长补短（就是都抄一遍的意思）

Q: 有没有什么想和刚入坑算法的同学分享的？

A: 我觉得刚入坑的同学们一定要学会处理自己的 “迷茫” 以及这种情绪带来的 “我不想做，这太难了”。我觉得在学习的过程中，只要能在自己感到迷茫的时候坚持再坚持，总会有那么一个 “顿悟”的时刻，然后就会觉得自己的坚持是值得的。
我在正式学习编程之前的两三年里，也经常想过转码，但每次都会因为 “选什么语言” 或者 “初始化环境设定” 太难了等这种原因放弃。现在其实回头看，这些问题其实都很简单。

Q: 相对而言，你觉得 91 天哪里做的还不够好？应该如何改进？

A:我希望 91 有更多的个人答题跟踪和一起打卡的人的榜单，这样大家可以相互鼓（shi）励（ya）

Q: 愿意把 91 天分享给你的朋友么？

A:当然愿意啦！我觉得新手入门的时候最难的就是选择 “学什么” ， 而  91 恰好解决了这个问题。加入了 91 之后，只要根据  91 已经制定好的计划每天努力就可以了。而且问题是循序渐进的，对新手非常友好~ 再加上有这么多同学和超级棒的讲师们一起，我觉得 91 是最棒的刷题计划啦！
  `
  }
]
